[
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6a",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "01",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "What Is HTML?",
      "author": {
        "name": "Jimmy Dane",
        "published_date": "2022-08-24 17:27:34",
        "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
      },
      "thumbnail_url": "https://i.ibb.co/QnwC4sG/unsplash-Eh-Tc-C9s-YXsw-11.png",
      "image_url": "https://i.postimg.cc/3Nx0nrhy/HTML-2.png",
      "details": "HTML stands for hypertext markup language. It's made of keywords and commands that web designers use for creating websites. Hypertext is text with links that readers can simply click on to go to another page or another part of the page. Meanwhile, markup language uses tags or plain text with special markings to define the sections of a page, such as headers and footers, and other elements, including tables and images.HTML is considered one of the three essential tools in webpage creation: HTML provides the structure or the way text, pictures, and so on will appear on the website. CSS (cascading style sheets) sets the visual properties of these elements, such as colors, format, and layout. Meanwhile, Javascript makes these elements behave in certain ways depending on a user's action. For example, the font size of text can increase when users hover their mouse or click a button on a page."
    },
    {
      "_id": "0282e0e58a5c404fbd15261f11c2ab6b",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "03",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 488,
      "title": "What is JavaScript ?",
      "author": {
        "name": "Jimmy Dane",
        "published_date": "2022-08-24 17:27:34",
        "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
      },
      "thumbnail_url": "https://i.ibb.co/QnwC4sG/unsplash-Eh-Tc-C9s-YXsw-11.png",
      "image_url": "https://i.postimg.cc/rmcrRCYN/js.png",
      "details": "JavaScript is a dynamic computer programming language. It is lightweight and most commonly used as a part of web pages, whose implementations allow client-side script to interact with the user and make dynamic pages. It is an interpreted programming language with object-oriented capabilities.JavaScript was first known as LiveScript, but Netscape changed its name to JavaScript, possibly because of the excitement being generated by Java. JavaScript made its first appearance in Netscape 2.0 in 1995 with the name LiveScript. The general-purpose core of the language has been embedded in Netscape, Internet Explorer, and other web browsers.The ECMA-262 Specification defined a standard version of the core JavaScript language."
    },

    {
      "_id": "f69a695f037cd9484cecaea37ca71011",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "01",
      "rating": { "number": 4.8, "badge": "Excellent" },
      "total_view": 400,
      "title": "What's HTML Used For?",
      "author": {
        "name": "Jennifer Wood",
        "published_date": "2022-08-30 16:38:45",
        "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
      },
      "thumbnail_url": "https://i.ibb.co/k8XBcMX/unsplash-Eh-Tc-C9s-YXsw-15.png",
      "image_url": "https://i.postimg.cc/2ShydLWc/html-hpg-featured-new.png",
      "details": "HTML is the default language of websites and web-based documents. It helps a browser understand the structure and style of a document or files for viewing over the internet. It allows your web pages to host audio, videos, spreadsheets, and other applications. It also facilitates navigation within web pages or between websites through hypertext. Moreover, website makers can use HTML to design forms for ordering products, making reservations, or searching for information. HTML is, therefore, the basic building block for building your brand and running an e-commerce site or an online subscription-based business. "
    },
    {
      "_id": "f69a695f037cd9484cecaea37ca71012",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "02",
      "rating": { "number": 4.3, "badge": "Excellent" },
      "total_view": 400,
      "title": "What is CSS?",
      "author": {
        "name": "Jennifer Wood",
        "published_date": "2022-08-30 16:38:45",
        "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
      },
      "thumbnail_url": "https://i.ibb.co/k8XBcMX/unsplash-Eh-Tc-C9s-YXsw-15.png",
      "image_url": "https://i.postimg.cc/SKc9KtVK/css1.jpg",
      "details": "Cascading Style Sheets, fondly referred to as CSS, is a simple design language intended to simplify the process of making web pages presentable.CSS handles the look and feel part of a web page. Using CSS, you can control the color of the text, the style of fonts, the spacing between paragraphs, how columns are sized and laid out, what background images or colors are used, layout designs,variations in display for different devices and screen sizes as well as a variety of other effects.CSS is easy to learn and understand but it provides powerful control over the presentation of an HTML document. Most commonly, CSS is combined with the markup languages HTML or XHTML."
    },

    {
      "_id": "11468ed61aee84de492a8b04158a22f9",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": false
      },
      "category_id": "03",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 980,
      "title": "Client-Side JavaScript",
      "author": {
        "name": "system",
        "published_date": "2022-08-24 23:15:00",
        "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
      },
      "thumbnail_url": "https://i.ibb.co/HXC719r/unsplash-Eh-Tc-C9s-YXsw-19.png",
      "image_url": "https://i.postimg.cc/sXcZYQkd/js2.jpg",
      "details": "Client-side JavaScript is the most common form of the language. The script should be included in or referenced by an HTML document for the code to be interpreted by the browser.It means that a web page need not be a static HTML, but can include programs that interact with the user, control the browser, and dynamically create HTML content.The JavaScript client-side mechanism provides many advantages over traditional CGI server-side scripts. For example, you might use JavaScript to check if the user has entered a valid e-mail address in a form field.The JavaScript code is executed when the user submits the form, and only if all the entries are valid, they would be submitted to the Web Server.JavaScript can be used to trap user-initiated events such as button clicks, link navigation, and other actions that the user initiates explicitly or implicitly."
    },

    {
      "_id": "2e78e5e0310c2e9adbb6efb1a263e745",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "02",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": null,
      "title": "Who Creates and Maintains CSS?",
      "author": {
        "name": null,
        "published_date": "2022-08-30 15:00:04",
        "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
      },
      "thumbnail_url": "https://i.ibb.co/k8XBcMX/unsplash-Eh-Tc-C9s-YXsw-15.png",
      "image_url": "https://i.postimg.cc/BnrD4GTy/css2.webp",
      "details": "CSS is created and maintained through a group of people within the W3C called the CSS Working Group. The CSS Working Group creates documents called specifications. When a specification has been discussed and officially ratified by the W3C members, it becomes a recommendation.These ratified specifications are called recommendations because the W3C has no control over the actual implementation of the language. Independent companies and organizations create that software.NOTE − The World Wide Web Consortium, or W3C is a group that makes recommendations about how the Internet works and how it should evolve."
    },

    {
      "_id": "e342b6c0c8efc8ca9e811991dc8a7900",
      "others_info": {
        "is_todays_pick": true,
        "is_trending": false
      },
      "category_id": "04",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 733,
      "title": "What Is React?",
      "author": {
        "name": "Theo Minh Châu",
        "published_date": "2022-08-25 06:03:00",
        "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
      },
      "thumbnail_url": "https://i.ibb.co/j86wjDW/unsplash-Eh-Tc-C9s-YXsw-20.png",
      "image_url": "https://i.postimg.cc/2685fHKM/react2.png",
      "details": "The Best Guide to Know What Is React Lesson 1 of 11By Chinmayee Deshpande Last updated on Feb 7, 202311366895 The Best Guide to Know What Is React PreviousNext Table of Contents What Is React?ReactJS HistoryWhy React?ReactJS KeysReactJS AdvantagesView More The world can't live without mobile and web applications in this day and age. Everything is digitized, from booking cabs to ordering food to make bank transactions. Thanks to the efficient frameworks that provide a seamless user experience. One such robust frontend library is React. This tutorial on ‘what is React’ will help you understand the library's fundamentals and work with a simple demo.What Is React? React-Frontend_Language React is a JavaScript-based UI development library. Facebook and an open-source developer community run it. Although React is a library rather than a language, it is widely used in web development. The library first appeared in May 2013 and is now one of the most commonly used frontend libraries for web development.React offers various extensions for entire application architectural support, such as Flux and React Native, beyond mere UI."
    },
    {
      "_id": "e342b6c0c8efc8ca9e811991dc8a7901",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": false
      },
      "category_id": "04",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 733,
      "title": "ReactJS Keys",
      "author": {
        "name": "Theo Minh Châu",
        "published_date": "2022-08-25 06:03:00",
        "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
      },
      "thumbnail_url": "https://i.ibb.co/df3gJ1b/unsplash-Eh-Tc-C9s-YXsw-13.png",
      "image_url": "https://i.postimg.cc/J0S7ZRzC/React-18-New-features-a9ebb05f34.jpg",
      "details": "After answering what is ReactJs, let us know what are keys. While dealing with components that are produced periodically in React, keys are essential. Your component will continue to be uniquely identifiable after the modification if the key value is set.  They aid React in determining which elements have changed, been eliminated, or been added. When making lists of components in React, you must use a special string personality factor. React uses keys to indicate which list items have been modified, destroyed, or altered. Or, to put it another way, we may say that keys are utilized to identify the components in lists."
    },

    {
      "_id": "f06f8cc035b04bd1158e4198281915a3",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "05",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 127,
      "title": "What is Node.js?",
      "author": {
        "name": "Ukrainska Pravda",
        "published_date": "2022-08-25 18:53:49",
        "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
      },
      "thumbnail_url": "https://i.ibb.co/0swsWpF/unsplash-Eh-Tc-C9s-YXsw-17.png",
      "image_url": "https://i.postimg.cc/XNPYTkc1/node.png",
      "details": "Node.js is a server-side platform built on Google Chrome's JavaScript Engine (V8 Engine). Node.js was developed by Ryan Dahl in 2009 and its latest version is v0.10.36. The definition of Node.js as supplied by its official documentation is as follows −Node.js is a platform built on Chrome's JavaScript runtime for easily building fast and scalable network applications. Node.js uses an event-driven, non-blocking I/O model that makes it lightweight and efficient, perfect for data-intensive real-time applications that run across distributed devices. Node.js is an open source, cross-platform runtime environment for developing server-side and networking applications. Node.js applications are written in JavaScript, and can be run within the Node.js runtime on OS X, Microsoft Windows, and Linux."
    },
    {
      "_id": "f06f8cc035b04bd1158e4198281915a4",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": true
      },
      "category_id": "05",
      "rating": { "number": 4.5, "badge": "Excellent" },
      "total_view": 127,
      "title": "Why Do We Use NodeJs?",
      "author": {
        "name": "Ukrainska Pravda",
        "published_date": "2022-08-25 18:53:49",
        "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
      },
      "thumbnail_url": "https://i.ibb.co/dr4TRY4/unsplash-Eh-Tc-C9s-YXsw-21.png",
      "image_url": "https://i.postimg.cc/d1HVQ2M1/parts-of-nodejs.webp",
      "details": "There are many reasons for which we prefer using NodeJs for the server side of our application, some of them are discussed in the following: NodeJs is built on Google Chrome’s V8 engine, and for this reason its execution time is very fast and it runs very quickly.There are more than 50,000 bundles available in the Node Package Manager and for that reason developers can import any of the packages any time according to their needed functionality for which a lot of time is saved.As NodeJs do not need to wait for an API to return data , so for building real time and data intensive web applications, it is very useful. It is totally asynchronous in nature that means it is totally non-blocking. The loading time for an audio or video is reduced by NodeJs because there is better synchronization of the code between the client and server for having the same code base. As NodeJs is open-source and it is nothing but a JavaScript framework , so for the developers who are already used to JavaScript, for them starting developing their projects with NodeJs is very easy."
    },
    {
      "_id": "61f9ce168f7b15aadecb1d1fc80c72f7",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": false
      },
      "category_id": "06",
      "rating": { "number": 4.5, "badge": "Excellent" },

      "total_view": 100,
      "title": "What is MongoDB?",
      "author": {
        "name": "system",
        "published_date": "2022-08-26 00:37:24",
        "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
      },
      "thumbnail_url": "https://i.ibb.co/1rcTYYB/unsplash-Eh-Tc-C9s-YXsw-16.png",
      "image_url": "https://i.postimg.cc/fyqtF4W8/Mongo-DB-sm-logo-500x400-1-1.gif",
      "details": "MongoDB is an open source NoSQL database management program. NoSQL (Not only SQL) is used as an alternative to traditional relational databases. NoSQL databases are quite useful for working with large sets of distributed data. MongoDB is a tool that can manage document-oriented information, store or retrieve information.MongoDB is used for high-volume data storage, helping organizations store large amounts of data while still performing rapidly. Organizations also use MongoDB for its ad-hoc queries, indexing, load balancing, aggregation, server-side JavaScript execution and other features.Structured Query Language (SQL) is a standardized programming language that is used to manage relational databases. SQL normalizes data as schemas and tables, and every table has a fixed structure."
    },
    {
      "_id": "61f9ce168f7b15aadecb1d1fc80c72f7",
      "others_info": {
        "is_todays_pick": false,
        "is_trending": false
      },
      "category_id": "06",
      "rating": { "number": 4.5, "badge": "Excellent" },

      "total_view": 100,
      "title": "How does MongoDB work?",
      "author": {
        "name": "system",
        "published_date": "2022-08-26 00:37:24",
        "img": "https://images.unsplash.com/photo-1633332755192-727a05c4013d?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MXx8dXNlcnxlbnwwfHwwfHw%3D&w=1000&q=80"
      },
      "thumbnail_url": "https://i.ibb.co/1rcTYYB/unsplash-Eh-Tc-C9s-YXsw-16.png",
      "image_url": "https://i.postimg.cc/nV3DMmKq/mongobd.png",
      "details": "MongoDB environments provide users with a server to create databases with MongoDB. MongoDB stores data as records that are made up of collections and documents. Documents contain the data the user wants to store in the MongoDB database. Documents are composed of field and value pairs. They are the basic unit of data in MongoDB. The documents are similar to JavaScript Object Notation (JSON) but use a variant called Binary JSON (BSON). The benefit of using BSON is that it accommodates more data types. The fields in these documents are like the columns in a relational database. Values contained can be a variety of data types, including other documents, arrays and arrays of documents, according to the MongoDB user manual. Documents will also incorporate a primary key as a unique identifier. A document's structure is changed by adding or deleting new or existing fields."
    }
  ]